Ran Plan for 2 projects:

1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
1. project: `development` dir: `deployment/dev/terraform` workspace: `default`

### 1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.google_project.current: Read complete after 2s [id=projects/bits-backstage-prod]
module.postgres.data.google_compute_zones.available[0]: Reading...
module.postgres.data.google_compute_zones.available[0]: Read complete after 0s [id=projects/bits-backstage-prod/regions/us-east4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_project_iam_member.sa_access will be created
+ resource "google_project_iam_member" "sa_access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull-sa@broadinstitute.org"
+       project = "bits-backstage-prod"
+       role    = "roles/owner"
    }

  # google_project_iam_member.team_access will be created
+ resource "google_project_iam_member" "team_access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull@broadinstitute.org"
+       project = "bits-backstage-prod"
+       role    = "roles/editor"
    }

  # google_service_account_iam_member.db_workload_identity will be created
+ resource "google_service_account_iam_member" "db_workload_identity" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "serviceAccount:bits-gke-clusters.svc.id.goog[backstage/backstage]"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.client"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/cloudsql.client"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.instanceUser"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/cloudsql.instanceUser"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/iam.serviceAccountTokenCreator"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.metricWriter"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.viewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/monitoring.viewer"
    }

  # module.db_service_accounts.google_service_account.service_accounts["backstage"] will be created
+ resource "google_service_account" "service_accounts" {
+       account_id   = "backstage"
+       description  = "service account for CloudSQL access"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "bits-backstage-prod"
+       unique_id    = (known after apply)
    }

  # module.postgres.google_sql_database.default[0] will be created
+ resource "google_sql_database" "default" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database_instance.default will be created
+ resource "google_sql_database_instance" "default" {
+       available_maintenance_versions = (known after apply)
+       connection_name                = (known after apply)
+       database_version               = "POSTGRES_15"
+       deletion_protection            = false
+       dns_name                       = (known after apply)
+       encryption_key_name            = (known after apply)
+       first_ip_address               = (known after apply)
+       id                             = (known after apply)
+       instance_type                  = (known after apply)
+       ip_address                     = (known after apply)
+       maintenance_version            = (known after apply)
+       master_instance_name           = (known after apply)
+       name                           = "backstage-prod"
+       private_ip_address             = (known after apply)
+       project                        = "bits-backstage-prod"
+       psc_service_attachment_link    = (known after apply)
+       public_ip_address              = (known after apply)
+       region                         = "us-east4"
+       self_link                      = (known after apply)
+       server_ca_cert                 = (sensitive value)
+       service_account_email_address  = (known after apply)

+       settings {
+           activation_policy           = "ALWAYS"
+           availability_type           = "ZONAL"
+           connector_enforcement       = "NOT_REQUIRED"
+           deletion_protection_enabled = false
+           disk_autoresize             = true
+           disk_autoresize_limit       = 0
+           disk_size                   = 10
+           disk_type                   = "PD_SSD"
+           edition                     = "ENTERPRISE"
+           pricing_plan                = "PER_USE"
+           tier                        = "db-f1-micro"
+           user_labels                 = (known after apply)
+           version                     = (known after apply)

+           backup_configuration {
+               enabled                        = false
+               point_in_time_recovery_enabled = false
+               start_time                     = (known after apply)
+               transaction_log_retention_days = (known after apply)
            }

+           database_flags {
+               name  = "cloudsql.iam_authentication"
+               value = "on"
            }

+           ip_configuration {
+               enable_private_path_for_google_cloud_services = false
+               ipv4_enabled                                  = true
+               require_ssl                                   = true
+               ssl_mode                                      = (known after apply)
            }

+           maintenance_window {
+               day          = 1
+               hour         = 23
+               update_track = "canary"
            }
        }

+       timeouts {
+           create = "30m"
+           delete = "30m"
+           update = "30m"
        }
    }

  # module.postgres.google_sql_user.default[0] will be created
+ resource "google_sql_user" "default" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-prod"
+       name                    = "backstage"
+       password                = (sensitive value)
+       project                 = "bits-backstage-prod"
+       sql_server_user_details = (known after apply)
    }

  # module.postgres.google_sql_user.iam_account["backstage"] will be created
+ resource "google_sql_user" "iam_account" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-prod"
+       name                    = (known after apply)
+       project                 = "bits-backstage-prod"
+       sql_server_user_details = (known after apply)
+       type                    = (known after apply)
    }

  # module.postgres.null_resource.module_depends_on will be created
+ resource "null_resource" "module_depends_on" {
+       id       = (known after apply)
+       triggers = {
+           "value" = "0"
        }
    }

  # module.postgres.random_password.user-password will be created
+ resource "random_password" "user-password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       keepers     = {
+           "name" = "backstage-prod"
        }
+       length      = 32
+       lower       = true
+       min_lower   = 1
+       min_numeric = 1
+       min_special = 0
+       min_upper   = 1
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p production`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fprod%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p production`
</details>
Plan: 15 to add, 0 to change, 0 to destroy.

---
### 2. project: `development` dir: `deployment/dev/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # postgresql_grant.select["backstage"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.select["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "select" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "SELECT",
        ]
+       role              = "backstage@bits-backstage-dev.iam"
+       schema            = "public"
+       with_grant_option = false
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
- test = [
-       "backstage",
-       "backstage_plugin_app",
-       "backstage_plugin_auth",
-       "backstage_plugin_catalog",
-       "backstage_plugin_scaffolder",
-       "backstage_plugin_search",
    ] -> null
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p development`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fdev%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p development`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`